import { useCallback, useEffect, useState } from "react";

import { Badge, Colorpicker, Dialog, Highlight } from "./components";
import { Button } from "./components/Button";

function App() {
  const [isOpenModal, setIsOpenModal] = useState(false);

  const onClick = useCallback(() => {
    setIsOpenModal(true);
  }, []);

  return (
    <div id="App" className="w-full flex flex-col gap-3 items-center">
      <Highlight size="xs" text={`안녕하세요`} theme="progress" />
      <Highlight theme="light" text={`나는 이숙영이다요.`} />
      <Highlight
        size="md"
        theme="error"
        text={`블로그데스네\n가나다라마바사아자차카타파하가나다라마바사아자차카타파하\n29192391`}
      />
      <Highlight theme="success" size="lg" text={`호호호호하하하하히히히`} />
      <Highlight
        theme="warning"
        size="xl"
        text={`Automating Repetitive Tasks: Productivity Hacks for Developers`}
      />
      <Button onClick={onClick} text="다이얼로그 열기 버튼" />
      <Button
        isOutline
        theme={"success"}
        onClick={onClick}
        text="다이얼로그 열기 버튼"
      />
      <Colorpicker theme="success" />
      <Button theme={"light"} onClick={onClick} text="다이얼로그 열기 버튼" />
      <Button isOutline theme={"error"} onClick={onClick} text="ERROR 버튼" />
      <Button disabled onClick={onClick} text="DISABLED!" />
      <Badge size="sm" text="SOOK BADGE" />
      <Badge theme="warning" text="SOOK BADGE" />
      <Badge customColor="#6a6f79" size="lg" text="PINK SOOK BADGE" />

      {isOpenModal && (
        <Dialog
          size="lg"
          isXIcon={true}
          //isFixedButton={false}
          handleClosePopup={() => setIsOpenModal(false)}
          handleConfirmPopup={() => {
            console.log("CONFIRM!"), setIsOpenModal(false);
          }}
          title={
            "다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다"
          }
        >
          <h1>
            다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다
          </h1>
          <h2>
            다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다
          </h2>
          <p>
            다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다
            다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다
            다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다
            다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다
          </p>
        </Dialog>
      )}
    </div>
  );
}

export default App;
